[
	{
		"title": "Beyond Punishment Seminar Series 2019: Aboriginal Women in the Criminal Justice Network",
		"description": "This seminar will focus on strategies that aim to address the rising rates of incarceration of Aboriginal women, and to assist Aboriginal women prisoners to achieve reintegration into the community upon their release from custody.",
		"date": "23 May 2019",
		"time": "6.00PM - 7.30PM"
	},
	{
		"title": "Where are the Italian Mafias in Italy and Abroad?",
		"description": "This presentation, with speaker A/Professor Francesco Calderoni of Università Cattolica del Sacro Cuore (Milan, Italy), will discuss the movement of the Italian mafias from the territories of origin in the South of Italy to other Italian regions and countries of the world.",
		"date": "28 May 2019",
		"time": "6.00PM - 7.15PM"
	},
	{
		"title": "JSI Seminar: Rejecting Retributivism: Free Will, Punishment, and Criminal Justice",
		"description": "Professor Gregg D. Caruso of Macquarie University presents this JSI seminar. One of the most prominent justifications of legal punishment, historically and currently, is retributivism, according to which wrongdoers deserve the imposition of a penalty solely for the backward-looking reason that they have knowingly done wrong.",
		"date": "30 May 2019",
		"time": "6.00PM - 8.00PM"
	},
	{
		"title": "Interpretive Disputes in Contract Law",
		"description": "In this seminar, Dr Ryan Catterwell (University of Queensland) sets out practical guidance for dealing with interpretive disputes in contract law. Dr Catterwell claims that contract interpretation is a process through which objective intention is inferred from the choice of words in a contract.",
		"date": "05 June 2019",
		"time": "1.00PM - 2.00PM"
	},
	{
		"title": "Book Launch: Born at the Right Time. A memoir by Professor Ron McCallum",
		"description": "'A moving book on the life of a brilliant man who often \"saw\" the needs of our world more clearly than the sighted people around him.' - The Hon Michael Kirby AC CMG Past Justice of the High Court of Australia.",
		"date": "25 June 2019",
		"time": "6.00PM - 8.00PM"
	}
]
